#+title: Algorithm Analysis
#+subtitle:Lab Session 2.2
#+author: NTNU IDATA 2302
#+date: Aug 30, 2021


** Average case Analysis

The limitation of the best and worst case analysis is that they do not
say much about what we should expect in average. In many situations,
these worse and base are rare events that are not representative of
a random execution.

The first step is to model the runtime efficiency. To to that, I would
define a function that maps the values chosen by the user to the time
it take our algorithm to complete.

\[
time(p_1, p_2) = \begin{cases}
4 & \text{if } p_1 = \text{rock} \land p2 = \text{rock} \\
7 & \text{if } p_1 = \text{rock} \land p2 = \text{paper} \\
10 & \text{if } p_1 = \text{rock} \land p2 = \text{scissor} \\
13 & \text{if } p_1 = \text{paper} \land p2 = \text{rock} \\
16 & \text{if } p_1 = \text{paper} \land p2 = \text{paper} \\
19 & \text{if } p_1 = \text{paper} \land p2 = \text{scissor} \\
22 & \text{if } p_1 = \text{scissor} \land p2 = \text{rock} \\
25 & \text{if } p_1 = \text{scissor} \land p2 = \text{paper} \\
28 & \text{if } p_1 = \text{scissor} \land p2 = \text{scissor} \\
28 & \text{otherwise} \\
\end{cases}
\]

The challenge here is that, /without any further assumption/, we do know
often a given case shows up.

To estimate an average case, we must make an assumption about the
behavior of the players. How likely is it for Player 1 to choose
~ROCK~, to choose ~PAPER~,to choose ~SCISSOR~, or to provide an
invalid value?. The very same holds for Player 2.


To do this rigorously---at least as much as I can---I replace the two
variable $p_1$ and $p_2$, by two /random variables/ named $P_1$ and
$P_2$, which represent the values chosen by Player 1 and Player 2,
respectively. These two random variables have the following properties
 - $P_1 \in C$ where $C = \{\text{ROCK}, \text{PAPER}, \text{SCISSOR}, \text{ERROR}\}$
 - $P_1$ and $P_2$ are uniformly distributed, that is $\forall c \in C, \Pr[P_1 =
   c] = \Pr[P_2=c] = \frac{1}{4}$

With this we can now express the average case as the expected value of
the time function:

\begin{align*}
    \text{average runtime} &= \text{Exp}[time(P_1, P_2)] \\
                           &= \sum_{(p_1, p_2) \in C^2} \Pr[P_1=p_1 \land P_2=p_2] \cdot time(p_1, p_2) \\
                           &= \sum_{(p_1, p_2) \in C^2} \Pr[P_1=p_1] \cdot \Pr[P_2=p_2] \cdot time(p_1, p_2) \\
\end{align*}

The definition of an /expected value/ in Probability tells us that it
equals the sum of all possible values weighted by their probability. I
do not know how to further simplify this expression, but we can solve
it by enumerating all the cases, as I do in Table [[table:cases]], where I
list each all input cases, the runtime and its probability. We obtain
an average runtime execution of 21.25 unit of time.

#+name: table:cases
#+caption: All the possible inputs and their probability
|----------+-----------+--------------+----------+---------|
| Player 1 |  Player 2 |  Probability |  Runtime | Product |
|----------+-----------+--------------+----------+---------|
| rock     | rock      | 1/16         |        4 |    0.25 |
| rock     | paper     | 1/16         |        7 |  0.4375 |
| rock     | scissor   | 1/16         |       10 |   0.625 |
| paper    | rock      | 1/16         |       13 |  0.8125 |
| paper    | paper     | 1/16         |       16 |      1. |
| paper    | scissor   | 1/16         |       19 |  1.1875 |
| scissor  | rock      | 1/16         |       22 |   1.375 |
| scissor  | paper     | 1/16         |       25 |  1.5625 |
| scissor  | scissor   | 1/16         |       28 |    1.75 |
|----------+-----------+--------------+----------+---------|
| invalid  | rock      | 1/16         |       28 |    1.75 |
| invalid  | paper     | 1/16         |       28 |    1.75 |
| invalid  | scissor   | 1/16         |       28 |    1.75 |
| invalid  | invalid   | 1/16         |       28 |    1.75 |
| rock     | invalid   | 1/16         |       28 |    1.75 |
| paper    | invalid   | 1/16         |       28 |    1.75 |
| scissor  | invalid   | 1/16         |       28 |    1.75 |
|----------+-----------+--------------+----------+---------|
|          | Totals    | 1.           |          |   21.25 |
#+tblfm: @>$5=vsum(@I..@II) 

You may have noted that the way we model the user is a gross
simplification. In practice, there is not four possible values, but a
large number since our program accepts integer values as
inputs. I see two alternatives:
 -  If we assume a more realistic computation model, for example where
   memory cells are bounded to 32 bits values, then the probability of
   an erroneous input would dominate and we would obtain a result very
   close to the worse case. Note that $\Pr[P=\text{invalid}] =
   1 - \frac{1}{2^{32}-3} = 0.99999999976$.
 - We could also adhere to the RAM model. There is thus an infinity
   of erroneous cases. I not very confident I could solve this one.

Regardless, the takeaway is that the result we obtain depends on the
assumption we make, that is how we model the behavior of the user.

  

  
